matianfu/stm32f407_aoa/Src/usb_host_helper.c
#include <stdio.h>
#include "debug.h"
#include "usbh_conf.h"
#include "usbh_core.h"
#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"


#define PRT_REGBITS(prefix, regname, bitname)           \
printf(" " #bitname " %lu", ((reg & prefix##_##regname##_##bitname) >> bitmask_shift(prefix##_##regname##_##bitname)));

#define PRT_REGBITS_NEWLINE()                           \
printf(NEW_LINE "                  ");

#define PRTREG_BEGIN(prefix, regname)                   \
static void PRT_##prefix##_##regname (uint32_t reg)     \
{                                                       \
printf("  " #prefix "_" #regname ":");                  \

#define PRTREG_END                                      \
printf(NEW_LINE);                                       \
}

#define DEFINE_PRTREG3(prefix, regname, bm1)            \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRTREG_END

#define DEFINE_PRTREG4(prefix, regname, bm1, bm2)       \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRTREG_END

#define DEFINE_PRTREG5(prefix, regname, bm1, bm2, bm3)  \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRTREG_END

#define DEFINE_PRTREG6(prefix, regname, bm1, bm2, bm3,  \
    bm4)                                                \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRTREG_END

#define DEFINE_PRTREG7(prefix, regname, bm1, bm2, bm3,  \
    bm4, bm5)                                           \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRTREG_END

#define DEFINE_PRTREG8(prefix, regname, bm1, bm2, bm3,  \
    bm4, bm5, bm6)                                      \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRTREG_END


#define DEFINE_PRTREG9(prefix, regname, bm1, bm2, bm3,  \
    bm4, bm5, bm6, bm7)                                 \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRTREG_END

#define DEFINE_PRTREG10(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8)                            \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRTREG_END

#define DEFINE_PRTREG11(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9)                       \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRTREG_END

#define DEFINE_PRTREG12(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10)                 \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRTREG_END

#define DEFINE_PRTREG13(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11)           \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRTREG_END

