matianfu/stm32f407_aoa/Src/usb_host_helper.c
#define DEFINE_PRTREG14(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12)     \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRTREG_END

#define DEFINE_PRTREG15(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13)                                               \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRTREG_END

#define DEFINE_PRTREG16(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14)                                         \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRTREG_END

#define DEFINE_PRTREG17(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15)                                   \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRTREG_END

#define DEFINE_PRTREG18(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16)                             \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRTREG_END

#define DEFINE_PRTREG19(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17)                       \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRTREG_END

