matianfu/stm32f407_aoa/Src/usb_host_helper.c
#define DEFINE_PRTREG20(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18)                 \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRTREG_END

#define DEFINE_PRTREG21(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18, bm19)           \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRT_REGBITS(prefix, regname, bm19)                      \
PRTREG_END

#define DEFINE_PRTREG22(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18, bm19, bm20)     \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRT_REGBITS(prefix, regname, bm19)                      \
PRT_REGBITS(prefix, regname, bm20)                      \
PRTREG_END

#define DEFINE_PRTREG23(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18, bm19, bm20,     \
    bm21)                                               \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRT_REGBITS(prefix, regname, bm19)                      \
PRT_REGBITS(prefix, regname, bm20)                      \
PRT_REGBITS(prefix, regname, bm21)                      \
PRTREG_END


#define DEFINE_PRTREG24(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18, bm19, bm20,     \
    bm21, bm22)                                         \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRT_REGBITS(prefix, regname, bm19)                      \
PRT_REGBITS(prefix, regname, bm20)                      \
PRT_REGBITS(prefix, regname, bm21)                      \
PRT_REGBITS(prefix, regname, bm22)                      \
PRTREG_END


#define DEFINE_PRTREG25(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18, bm19, bm20,     \
    bm21, bm22, bm23)                                   \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRT_REGBITS(prefix, regname, bm19)                      \
PRT_REGBITS(prefix, regname, bm20)                      \
PRT_REGBITS(prefix, regname, bm21)                      \
PRT_REGBITS(prefix, regname, bm22)                      \
PRT_REGBITS(prefix, regname, bm23)                      \
PRTREG_END


#define DEFINE_PRTREG26(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18, bm19, bm20,     \
    bm21, bm22, bm23, bm24)                             \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRT_REGBITS(prefix, regname, bm19)                      \
PRT_REGBITS(prefix, regname, bm20)                      \
PRT_REGBITS(prefix, regname, bm21)                      \
PRT_REGBITS(prefix, regname, bm22)                      \
PRT_REGBITS(prefix, regname, bm23)                      \
PRT_REGBITS(prefix, regname, bm24)                      \
PRTREG_END


#define DEFINE_PRTREG27(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18, bm19, bm20,     \
    bm21, bm22, bm23, bm24, bm25)                       \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRT_REGBITS(prefix, regname, bm19)                      \
PRT_REGBITS(prefix, regname, bm20)                      \
PRT_REGBITS(prefix, regname, bm21)                      \
PRT_REGBITS(prefix, regname, bm22)                      \
PRT_REGBITS(prefix, regname, bm23)                      \
PRT_REGBITS(prefix, regname, bm24)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm25)                      \
PRTREG_END


#define DEFINE_PRTREG28(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18, bm19, bm20,     \
    bm21, bm22, bm23, bm24, bm25, bm26)                 \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRT_REGBITS(prefix, regname, bm19)                      \
PRT_REGBITS(prefix, regname, bm20)                      \
PRT_REGBITS(prefix, regname, bm21)                      \
PRT_REGBITS(prefix, regname, bm22)                      \
PRT_REGBITS(prefix, regname, bm23)                      \
PRT_REGBITS(prefix, regname, bm24)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm25)                      \
PRT_REGBITS(prefix, regname, bm26)                      \
PRTREG_END


#define DEFINE_PRTREG29(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18, bm19, bm20,     \
    bm21, bm22, bm23, bm24, bm25, bm26, bm27)           \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRT_REGBITS(prefix, regname, bm19)                      \
PRT_REGBITS(prefix, regname, bm20)                      \
PRT_REGBITS(prefix, regname, bm21)                      \
PRT_REGBITS(prefix, regname, bm22)                      \
PRT_REGBITS(prefix, regname, bm23)                      \
PRT_REGBITS(prefix, regname, bm24)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm25)                      \
PRT_REGBITS(prefix, regname, bm26)                      \
PRT_REGBITS(prefix, regname, bm27)                      \
PRTREG_END


#define DEFINE_PRTREG30(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18, bm19, bm20,     \
    bm21, bm22, bm23, bm24, bm25, bm26, bm27, bm28)     \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRT_REGBITS(prefix, regname, bm19)                      \
PRT_REGBITS(prefix, regname, bm20)                      \
PRT_REGBITS(prefix, regname, bm21)                      \
PRT_REGBITS(prefix, regname, bm22)                      \
PRT_REGBITS(prefix, regname, bm23)                      \
PRT_REGBITS(prefix, regname, bm24)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm25)                      \
PRT_REGBITS(prefix, regname, bm26)                      \
PRT_REGBITS(prefix, regname, bm27)                      \
PRT_REGBITS(prefix, regname, bm28)                      \
PRTREG_END


#define DEFINE_PRTREG31(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18, bm19, bm20,     \
    bm21, bm22, bm23, bm24, bm25, bm26, bm27, bm28,     \
    bm29)                                               \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRT_REGBITS(prefix, regname, bm19)                      \
PRT_REGBITS(prefix, regname, bm20)                      \
PRT_REGBITS(prefix, regname, bm21)                      \
PRT_REGBITS(prefix, regname, bm22)                      \
PRT_REGBITS(prefix, regname, bm23)                      \
PRT_REGBITS(prefix, regname, bm24)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm25)                      \
PRT_REGBITS(prefix, regname, bm26)                      \
PRT_REGBITS(prefix, regname, bm27)                      \
PRT_REGBITS(prefix, regname, bm28)                      \
PRT_REGBITS(prefix, regname, bm29)                      \
PRTREG_END


