matianfu/stm32f407_aoa/Src/usb_host_helper.c
#define DEFINE_PRTREG32(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18, bm19, bm20,     \
    bm21, bm22, bm23, bm24, bm25, bm26, bm27, bm28,     \
    bm29, bm30)                                         \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRT_REGBITS(prefix, regname, bm19)                      \
PRT_REGBITS(prefix, regname, bm20)                      \
PRT_REGBITS(prefix, regname, bm21)                      \
PRT_REGBITS(prefix, regname, bm22)                      \
PRT_REGBITS(prefix, regname, bm23)                      \
PRT_REGBITS(prefix, regname, bm24)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm25)                      \
PRT_REGBITS(prefix, regname, bm26)                      \
PRT_REGBITS(prefix, regname, bm27)                      \
PRT_REGBITS(prefix, regname, bm28)                      \
PRT_REGBITS(prefix, regname, bm29)                      \
PRT_REGBITS(prefix, regname, bm30)                      \
PRTREG_END


#define DEFINE_PRTREG33(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18, bm19, bm20,     \
    bm21, bm22, bm23, bm24, bm25, bm26, bm27, bm28,     \
    bm29, bm30, bm31)                                   \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRT_REGBITS(prefix, regname, bm19)                      \
PRT_REGBITS(prefix, regname, bm20)                      \
PRT_REGBITS(prefix, regname, bm21)                      \
PRT_REGBITS(prefix, regname, bm22)                      \
PRT_REGBITS(prefix, regname, bm23)                      \
PRT_REGBITS(prefix, regname, bm24)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm25)                      \
PRT_REGBITS(prefix, regname, bm26)                      \
PRT_REGBITS(prefix, regname, bm27)                      \
PRT_REGBITS(prefix, regname, bm28)                      \
PRT_REGBITS(prefix, regname, bm29)                      \
PRT_REGBITS(prefix, regname, bm30)                      \
PRT_REGBITS(prefix, regname, bm31)                      \
PRTREG_END


#define DEFINE_PRTREG34(prefix, regname, bm1, bm2, bm3, \
    bm4, bm5, bm6, bm7, bm8, bm9, bm10, bm11, bm12,     \
    bm13, bm14, bm15, bm16, bm17, bm18, bm19, bm20,     \
    bm21, bm22, bm23, bm24, bm25, bm26, bm27, bm28,     \
    bm29, bm30, bm31, bm32)                             \
PRTREG_BEGIN(prefix, regname)                           \
PRT_REGBITS(prefix, regname, bm1)                       \
PRT_REGBITS(prefix, regname, bm2)                       \
PRT_REGBITS(prefix, regname, bm3)                       \
PRT_REGBITS(prefix, regname, bm4)                       \
PRT_REGBITS(prefix, regname, bm5)                       \
PRT_REGBITS(prefix, regname, bm6)                       \
PRT_REGBITS(prefix, regname, bm7)                       \
PRT_REGBITS(prefix, regname, bm8)                       \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm9)                       \
PRT_REGBITS(prefix, regname, bm10)                      \
PRT_REGBITS(prefix, regname, bm11)                      \
PRT_REGBITS(prefix, regname, bm12)                      \
PRT_REGBITS(prefix, regname, bm13)                      \
PRT_REGBITS(prefix, regname, bm14)                      \
PRT_REGBITS(prefix, regname, bm15)                      \
PRT_REGBITS(prefix, regname, bm16)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm17)                      \
PRT_REGBITS(prefix, regname, bm18)                      \
PRT_REGBITS(prefix, regname, bm19)                      \
PRT_REGBITS(prefix, regname, bm20)                      \
PRT_REGBITS(prefix, regname, bm21)                      \
PRT_REGBITS(prefix, regname, bm22)                      \
PRT_REGBITS(prefix, regname, bm23)                      \
PRT_REGBITS(prefix, regname, bm24)                      \
PRT_REGBITS_NEWLINE()                                   \
PRT_REGBITS(prefix, regname, bm25)                      \
PRT_REGBITS(prefix, regname, bm26)                      \
PRT_REGBITS(prefix, regname, bm27)                      \
PRT_REGBITS(prefix, regname, bm28)                      \
PRT_REGBITS(prefix, regname, bm29)                      \
PRT_REGBITS(prefix, regname, bm30)                      \
PRT_REGBITS(prefix, regname, bm31)                      \
PRT_REGBITS(prefix, regname, bm32)                      \
PRTREG_END










