matianfu/stm32f407_aoa/Src/usb_host_helper.c
/*
 * macro function overloading
 */
#define GET_MACRO(_1,_2,_3,_4,_5,_6,_7,_8,_9,_10,_11,   \
    _12,_13,_14,_15,_16,_17,_18,_19,_20,_21,_22,_23,_24,\
    _25,_26,_27,_28,_29,_30,_31,_32,_33,_34,NAME,...)   \
    NAME

#define DEFINE_PRTREG(...) GET_MACRO(__VA_ARGS__,       \
    DEFINE_PRTREG34, \
    DEFINE_PRTREG33, \
    DEFINE_PRTREG32, \
    DEFINE_PRTREG31, \
    DEFINE_PRTREG30, \
    DEFINE_PRTREG29, \
    DEFINE_PRTREG28, \
    DEFINE_PRTREG27, \
    DEFINE_PRTREG26, \
    DEFINE_PRTREG25, \
    DEFINE_PRTREG24, \
    DEFINE_PRTREG23, \
    DEFINE_PRTREG22, \
    DEFINE_PRTREG21, \
    DEFINE_PRTREG20, \
    DEFINE_PRTREG19, \
    DEFINE_PRTREG18, \
    DEFINE_PRTREG17, \
    DEFINE_PRTREG16, \
    DEFINE_PRTREG15, \
    DEFINE_PRTREG14, \
    DEFINE_PRTREG13, \
    DEFINE_PRTREG12, \
    DEFINE_PRTREG11, \
    DEFINE_PRTREG10, \
    DEFINE_PRTREG9, \
    DEFINE_PRTREG8, \
    DEFINE_PRTREG7, \
    DEFINE_PRTREG6, \
    DEFINE_PRTREG5, \
    DEFINE_PRTREG4, \
    DEFINE_PRTREG3, \
    DEFINE_PRTREG2)(__VA_ARGS__)




























extern USBH_HandleTypeDef hUsbHostHS;
extern HCD_HandleTypeDef hhcd_USB_OTG_HS;

/*
 * return 0 for valid bitmask, 1 for invalid
 */
//static int checkbit(uint32_t bits)
//{
//  int i, j = 0;
//  int up = 0, down = 0, prev_bit = 0, post_bit = 0;
//
//  for (i = 0; i < sizeof(uint32_t); i++)
//  {
//    if (prev_bit == 0) {
//      if (bits & (i << i))
//        up++;
//    }
//    else {
//      if (!(bits & (i << i)))
//        down++;
//    }
//  }
//
//  if (prev_bit == 1)
//    down++;
//
//  if (up == 1 && down == 1)
//    return 0;
//
//  return -1;
//}

static int bitmask_shift(uint32_t bitmask)
{
  int i = 0;

  while ((((uint32_t)0x00000001) & bitmask) == 0){
    bitmask = (bitmask >> 1);
    i++;
  }

  return i;
}

#if 0
/********************  Bit definition forUSB_OTG_GOTGCTL register  ********************/
#define USB_OTG_GOTGCTL_SRQSCS                  ((uint32_t)0x00000001)            /*!< Session request success */
#define USB_OTG_GOTGCTL_SRQ                     ((uint32_t)0x00000002)            /*!< Session request */
#define USB_OTG_GOTGCTL_HNGSCS                  ((uint32_t)0x00000100)            /*!< Host negotiation success */
#define USB_OTG_GOTGCTL_HNPRQ                   ((uint32_t)0x00000200)            /*!< HNP request */
#define USB_OTG_GOTGCTL_HSHNPEN                 ((uint32_t)0x00000400)            /*!< Host set HNP enable */
#define USB_OTG_GOTGCTL_DHNPEN                  ((uint32_t)0x00000800)            /*!< Device HNP enabled */
#define USB_OTG_GOTGCTL_CIDSTS                  ((uint32_t)0x00010000)            /*!< Connector ID status */
#define USB_OTG_GOTGCTL_DBCT                    ((uint32_t)0x00020000)            /*!< Long/short debounce time */
#define USB_OTG_GOTGCTL_ASVLD                   ((uint32_t)0x00040000)            /*!< A-session valid */
#define USB_OTG_GOTGCTL_BSVLD                   ((uint32_t)0x00080000)            /*!< B-session valid */
#endif

DEFINE_PRTREG(USB_OTG, GOTGCTL, BSVLD, ASVLD, DBCT, CIDSTS, DHNPEN, HSHNPEN, HNPRQ, HNGSCS, SRQ, SRQSCS);

#if 0
/********************  Bit definition forUSB_OTG_GOTGINT register  ********************/
#define USB_OTG_GOTGINT_SEDET                   ((uint32_t)0x00000004)            /*!< Session end detected */
#define USB_OTG_GOTGINT_SRSSCHG                 ((uint32_t)0x00000100)            /*!< Session request success status change */
#define USB_OTG_GOTGINT_HNSSCHG                 ((uint32_t)0x00000200)            /*!< Host negotiation success status change */
#define USB_OTG_GOTGINT_HNGDET                  ((uint32_t)0x00020000)            /*!< Host negotiation detected */
#define USB_OTG_GOTGINT_ADTOCHG                 ((uint32_t)0x00040000)            /*!< A-device timeout change */
#define USB_OTG_GOTGINT_DBCDNE                  ((uint32_t)0x00080000)            /*!< Debounce done */
#endif

DEFINE_PRTREG(USB_OTG, GOTGINT, DBCDNE, ADTOCHG, HNGDET, HNSSCHG, SRSSCHG, SEDET);

#if 0
/********************  Bit definition forUSB_OTG_GAHBCFG register  ********************/
#define USB_OTG_GAHBCFG_GINT                    ((uint32_t)0x00000001)            /*!< Global interrupt mask */

#define USB_OTG_GAHBCFG_HBSTLEN                 ((uint32_t)0x0000001E)            /*!< Burst length/type */
#define USB_OTG_GAHBCFG_HBSTLEN_0               ((uint32_t)0x00000002)            /*!<Bit 0 */
#define USB_OTG_GAHBCFG_HBSTLEN_1               ((uint32_t)0x00000004)            /*!<Bit 1 */
#define USB_OTG_GAHBCFG_HBSTLEN_2               ((uint32_t)0x00000008)            /*!<Bit 2 */
#define USB_OTG_GAHBCFG_HBSTLEN_3               ((uint32_t)0x00000010)            /*!<Bit 3 */
#define USB_OTG_GAHBCFG_DMAEN                   ((uint32_t)0x00000020)            /*!< DMA enable */
#define USB_OTG_GAHBCFG_TXFELVL                 ((uint32_t)0x00000080)            /*!< TxFIFO empty level */
#define USB_OTG_GAHBCFG_PTXFELVL                ((uint32_t)0x00000100)            /*!< Periodic TxFIFO empty level */
#endif

DEFINE_PRTREG(USB_OTG, GAHBCFG, PTXFELVL, TXFELVL, DMAEN, HBSTLEN, GINT);

#if 0
/********************  Bit definition forUSB_OTG_GUSBCFG register  ********************/

#define USB_OTG_GUSBCFG_TOCAL                   ((uint32_t)0x00000007)            /*!< FS timeout calibration */
#define USB_OTG_GUSBCFG_TOCAL_0                 ((uint32_t)0x00000001)            /*!<Bit 0 */
#define USB_OTG_GUSBCFG_TOCAL_1                 ((uint32_t)0x00000002)            /*!<Bit 1 */
#define USB_OTG_GUSBCFG_TOCAL_2                 ((uint32_t)0x00000004)            /*!<Bit 2 */
#define USB_OTG_GUSBCFG_PHYSEL                  ((uint32_t)0x00000040)            /*!< USB 2.0 high-speed ULPI PHY or USB 1.1 full-speed serial transceiver select */
#define USB_OTG_GUSBCFG_SRPCAP                  ((uint32_t)0x00000100)            /*!< SRP-capable */
#define USB_OTG_GUSBCFG_HNPCAP                  ((uint32_t)0x00000200)            /*!< HNP-capable */

#define USB_OTG_GUSBCFG_TRDT                    ((uint32_t)0x00003C00)            /*!< USB turnaround time */
#define USB_OTG_GUSBCFG_TRDT_0                  ((uint32_t)0x00000400)            /*!<Bit 0 */
#define USB_OTG_GUSBCFG_TRDT_1                  ((uint32_t)0x00000800)            /*!<Bit 1 */
#define USB_OTG_GUSBCFG_TRDT_2                  ((uint32_t)0x00001000)            /*!<Bit 2 */
#define USB_OTG_GUSBCFG_TRDT_3                  ((uint32_t)0x00002000)            /*!<Bit 3 */
#define USB_OTG_GUSBCFG_PHYLPCS                 ((uint32_t)0x00008000)            /*!< PHY Low-power clock select */
#define USB_OTG_GUSBCFG_ULPIFSLS                ((uint32_t)0x00020000)            /*!< ULPI FS/LS select */
#define USB_OTG_GUSBCFG_ULPIAR                  ((uint32_t)0x00040000)            /*!< ULPI Auto-resume */
#define USB_OTG_GUSBCFG_ULPICSM                 ((uint32_t)0x00080000)            /*!< ULPI Clock SuspendM */
#define USB_OTG_GUSBCFG_ULPIEVBUSD              ((uint32_t)0x00100000)            /*!< ULPI External VBUS Drive */
#define USB_OTG_GUSBCFG_ULPIEVBUSI              ((uint32_t)0x00200000)            /*!< ULPI external VBUS indicator */
#define USB_OTG_GUSBCFG_TSDPS                   ((uint32_t)0x00400000)            /*!< TermSel DLine pulsing selection */
#define USB_OTG_GUSBCFG_PCCI                    ((uint32_t)0x00800000)            /*!< Indicator complement */
#define USB_OTG_GUSBCFG_PTCI                    ((uint32_t)0x01000000)            /*!< Indicator pass through */
#define USB_OTG_GUSBCFG_ULPIIPD                 ((uint32_t)0x02000000)            /*!< ULPI interface protect disable */
#define USB_OTG_GUSBCFG_FHMOD                   ((uint32_t)0x20000000)            /*!< Forced host mode */
#define USB_OTG_GUSBCFG_FDMOD                   ((uint32_t)0x40000000)            /*!< Forced peripheral mode */
#define USB_OTG_GUSBCFG_CTXPKT                  ((uint32_t)0x80000000)            /*!< Corrupt Tx packet */
#endif

DEFINE_PRTREG(USB_OTG, GUSBCFG, CTXPKT, FDMOD, FHMOD, ULPIIPD, PTCI, PCCI, TSDPS, ULPIEVBUSI, ULPIEVBUSD,
    ULPICSM, ULPIAR, ULPIFSLS, PHYLPCS, TRDT)

