matianfu/stm32f407_aoa/Src/usb_host_helper.c
#if 0
typedef struct
{
  __IO uint32_t GOTGCTL;      /*!<  USB_OTG Control and Status Register    000h*/
  __IO uint32_t GOTGINT;      /*!<  USB_OTG Interrupt Register             004h*/
  __IO uint32_t GAHBCFG;      /*!<  Core AHB Configuration Register    008h*/
  __IO uint32_t GUSBCFG;      /*!<  Core USB Configuration Register    00Ch*/
  __IO uint32_t GRSTCTL;      /*!<  Core Reset Register                010h*/
  __IO uint32_t GINTSTS;      /*!<  Core Interrupt Register            014h*/
  __IO uint32_t GINTMSK;      /*!<  Core Interrupt Mask Register       018h*/
  __IO uint32_t GRXSTSR;      /*!<  Receive Sts Q Read Register        01Ch*/
  __IO uint32_t GRXSTSP;      /*!<  Receive Sts Q Read & POP Register  020h*/
  __IO uint32_t GRXFSIZ;      /* Receive FIFO Size Register         024h*/
  __IO uint32_t DIEPTXF0_HNPTXFSIZ;   /*!<  EP0 / Non Periodic Tx FIFO Size Register 028h*/
  __IO uint32_t HNPTXSTS;     /*!<  Non Periodic Tx FIFO/Queue Sts reg 02Ch*/
  uint32_t Reserved30[2];     /* Reserved                           030h*/
  __IO uint32_t GCCFG;        /* General Purpose IO Register        038h*/
  __IO uint32_t CID;          /* User ID Register                   03Ch*/
  uint32_t  Reserved40[48];   /* Reserved                      040h-0FFh*/
  __IO uint32_t HPTXFSIZ; /* Host Periodic Tx FIFO Size Reg     100h*/
  __IO uint32_t DIEPTXF[0x0F];/* dev Periodic Transmit FIFO */
}
USB_OTG_GlobalTypeDef;
#endif

static void print_usb_otg_global_registers(void) {

  int i;

  HCD_HandleTypeDef *hhcd = &hhcd_USB_OTG_HS;

  PRT_USB_OTG_GOTGCTL(hhcd->Instance->GOTGCTL);
  PRT_USB_OTG_GOTGINT(hhcd->Instance->GOTGINT);
  PRT_USB_OTG_GAHBCFG(hhcd->Instance->GAHBCFG);
  PRT_USB_OTG_GUSBCFG(hhcd->Instance->GUSBCFG);
  PRT_USB_OTG_GRSTCTL(hhcd->Instance->GRSTCTL);
  PRT_USB_OTG_GINTSTS(hhcd->Instance->GINTSTS);
  PRT_USB_OTG_GINTMSK(hhcd->Instance->GINTMSK);
  PRT_USB_OTG_GRXSTSP(hhcd->Instance->GRXSTSR);               // read
  PRT_USB_OTG_GRXSTSP(hhcd->Instance->GRXSTSP);               // pop
  PRT_USB_OTG_GRXFSIZ(hhcd->Instance->GRXFSIZ);
  PRT_USB_OTG_GNPTXFSIZ(hhcd->Instance->DIEPTXF0_HNPTXFSIZ);
  PRT_USB_OTG_GNPTXSTS(hhcd->Instance->HNPTXSTS);
  PRT_USB_OTG_GCCFG(hhcd->Instance->GCCFG);
  PRT_USB_OTG_CID(hhcd->Instance->CID);
  PRT_USB_OTG_HPTXFSIZ(hhcd->Instance->HPTXFSIZ);

  /** seems to be device only regs **/
//  for (i = 0; i < 0x0F; i++)
//    PRT_USB_OTG_DIEPTXF(hhcd->Instance->DIEPTXF[i]);
}

/*****************************************************************************/

#if 0
/********************  Bit definition forUSB_OTG_HCFG register  ********************/

#define USB_OTG_HCFG_FSLSPCS                 ((uint32_t)0x00000003)            /*!< FS/LS PHY clock select */
#define USB_OTG_HCFG_FSLSPCS_0               ((uint32_t)0x00000001)            /*!<Bit 0 */
#define USB_OTG_HCFG_FSLSPCS_1               ((uint32_t)0x00000002)            /*!<Bit 1 */
#define USB_OTG_HCFG_FSLSS                   ((uint32_t)0x00000004)            /*!< FS- and LS-only support */
#endif

DEFINE_PRTREG(USB_OTG, HCFG, FSLSS, FSLSPCS);

#if 0
typedef struct
{
  __IO uint32_t HCFG;             /* Host Configuration Register    400h*/
  __IO uint32_t HFIR;      /* Host Frame Interval Register   404h*/
  __IO uint32_t HFNUM;         /* Host Frame Nbr/Frame Remaining 408h*/
  uint32_t Reserved40C;                   /* Reserved                       40Ch*/
  __IO uint32_t HPTXSTS;   /* Host Periodic Tx FIFO/ Queue Status 410h*/
  __IO uint32_t HAINT;   /* Host All Channels Interrupt Register 414h*/
  __IO uint32_t HAINTMSK;   /* Host All Channels Interrupt Mask 418h*/
}
USB_OTG_HostTypeDef;
#endif

static void print_usb_host_registers(void) {

  HCD_HandleTypeDef *hhcd = &hhcd_USB_OTG_HS;
  USB_OTG_GlobalTypeDef *USBx = hhcd->Instance;

  PRT_USB_OTG_HCFG(USBx_HOST->HCFG);
}

void usb_host_log(void)
{
  print_usb_otg_global_registers();
  print_usb_host_registers();
}


